import {Translations} from './en';

const fa: Translations = {
  common: {
    ok: 'بله',
    cancel: 'خیر',
    back: 'بازگشت',
    addBtn: 'اضافه کن',
    camera: 'دوربین',
    gallery: 'گالری',
  },
  numbers: {
    one: '۱',
    two: '۲',
    three: '۳',
    four: '۴',
    five: '۵',
    six: '۶',
    seven: '۷',
    eight: '۸',
    nine: '۹',
    ten: '۱۰',
  },
  bottomNavigator: {
    profile: 'پروفایل',
    learning: ' آموزش ',
    playGame: 'بازی',
    players: 'بازیکن ها',
    settings: 'تنظیمات',
  },
  settings: {
    title: 'تنظیمات',
    language: 'زبان',
    english: 'انگلیسی',
    persian: 'فارسی',
    nightMode: 'حالت شب',
    active: 'فعال',
    deactive: 'غیر فعال',
  },
  players: {
    addPlayerSucceed: '{player} به لیست اضافه شد',
    shouldWritePlayerName: 'نام بازیکن رو وارد کن',
    deletePlayersWithHold:
      'با نگه داشتن روی هر کارت میتوانید آن را از لیست حذف کنید',
  },
  learn: {
    title: 'آموزش',
  },
  game: {
    rolecards: {
      jackTypeDesc: {
        godfatherDesc:
          'او از یک بار شلیک شب لئون مصون است.یک جلیقه دارد.تعیین شلیک شب از طرف گروه به عهده پدرخوانده است و اگر از بازی خارج شود دیگر اعضا به جای او شلیک می کنند.پدرخوانده دارای توانایی حس ششم است و اگر در شب تصمیم بگیرد به جای شلیک از حس ششم استفاده کند باید نقش بازیکنی را درست حدس بزند و توسط گرداننده تائید شود.بازیکنی که پدرخوانده نقش او را درست حدس زده است سلاخی می شود یعنی اگر سپر داشته باشد یا دکتر او را سیو کرده باشد بازهم از بازی خارج می شود و آن شب توانایی وی اعمال نخواهد شد و پس از خروج از بازی توسط کنستانتین قابل احضار نمی باشد.استعلام پدرخوانده برای نوستراداموس شهروندی بوده ولی برای همشهری کین مافیایی و مثبت خواهد بود.',
        matadorDesc:
          'شب ها با تیم مافیا بیدار می شود و هر شب از توانایی خود استفاده می کند.در شب هر بازیکنی را نشان دهد توانایی شب او را آن شب از وی خواهد گرفت و فرد نشان شده اگر بیدار شود با ضربدر گرداننده مواجه می شود اما فردا مجدد می تواند از توانایی اش استفاده کند.ماتادور دو شب متوالی نمی تواند یک بازیکن را نشان کند.',
        saulDesc:
          'اگر فردی از گروه مافیا خارج شود ساول می تواند جای شلیک شب معامله و خریداری انجام دهد.ساول گودمن فقط یکبار می تواند یکی از شهروندان ساده را به یک مافیای ساده تبدیل کند.با علامت او همان شب گرداننده آن فرد را از نقش جدیدش یعنی مافیای ساده مطلع می کند و وی را بیدار می کند تا هم تیمی های خود را بشناسد.اگر ساول گودمن شهروند غیرساده یا نوستراداموس را انتخاب کند با ضربدر گرداننده مواجه شده و گرداننده نشانش را بیدار نمی کند.توانمندی ساول و شلیک آن شب مافیا نیز از بین می رود.',
        ckaneDesc:
          'شهروندی است که در یکی از شب ها به انتخاب خود به دعوت گرداننده یکی از بازیکنان را نشان می دهد.اگر یک مافیا را درست نشان کرده باشد صبح روز بعد گرداننده ساید مافیای نشان شده را در جمع افشا می کند.و همشهری کین شب بعد کشته می شود.دکتر توانایی نجات او را ندارد.اما اگر نشانش از ساید مافیا نبود گرداننده هیچ چیزی اعلام نخواهد کرد و همشهری کین در بازی خواهد ماند و استعلامش از بین خواهد رفت.اگر او یا نشانش کشته شوند عملیات شب وی اجرا نشده و از بین نمی رود و همچنان باقی می ماند.استعلام پدرخوانده برای همشهری کین مافیایی است.',
        leonDesc:
          'هرشبی که بخواهد می تواند به یکی از اعضای تیم مافیا شلیک کند.اما با شلیک اشتباه به شهروندان به مجازات خودش کشته می شود و دکتر نمی تواند او را نجات دهد.لئون یک جلیقه دارد که یکبار از تیر نجات پیدا می کند.حداکثر دو شلیک دارد.',
        doctorDesc:
          'هرشب می تواند جان یک نفر چه عضو مافیا و چه عضو شهروندی را نجات دهد.جان خودش را یکبار می تواند در طول بازی نجات دهد ولی در نجات جان دیگران محدودیتی ندارد',
        constantineDesc:
          'گرداننده کنستانتین را بیدار می کند تا او به انتخاب خود و تنها یک بار یک نفر از بازیکنان اخراجی اعم از مافیا شهروند و یا مستقل را به بازی برگرداند.غیر از نقش های افشا شده.توانایی های بازیکن احضار شده ادامه پیدا می کند و از بین نمی رود و از نو نمی شود.',
        citizenDesk:
          'نقش شهروند ساده کمک به هم تیمی های خود در تشخیص مافیا به درستی است و رای دادن با زرنگی به اعضای مافیاست. او در شب نقش خاصی را ایفا نمی کند و بیشتر به روند بازی و تیم شهروندی در پیروز شدن است.\n شهروند ساده میبایست سعی کند در روز مافیا ها را با دقت شناسایی کند و به آن ها رای دهد و در شب عمل خاصی را انجام نمی دهد.',
        jackDesc:
          'جک نه مافیا است و نه شهروند مستقل است و باید تنهایی بازی را ببرد.جک شب ها نا میرا است و با تیر شب بیرون نمی رود.همچنین در روز را رای هم بیرون نمی رود و فقط نقشش شو می شود.جک باید هر شب یک نفر را طلسم کند البته حتی شب معارفه البته اون نمی تواند تکراری کسی را طلسم کند مگر همه را طلسم کرده باشد.جک فقط در سه صورت از بازی خارج می شود.یک اگر طلسمش از بازی خارج شده باشد دو اگر با کارت ذهن زیبا نقشش حدس زده شود و یا اگر نقشش شو شده باشد و با کارت ذهن زیبا طلسمش حدس زده شود از بازی می رود و سه با حس ششم پدرخوانده.اگر تمام مافیا ها خارج شده باشند شهر برنده نمی شود و جک برنده می شود و یا اگر به سه نفر آخر برسد نیز برنده می شود.اگر دو شهروند و جک و سه مافیا در بازی باشد مافیا ها برنده بازی نیستند و باید طلسم جک رو از بازی خارج کنند.',
      },
      nustraTypeDesc: {
        godfatherDesc:
          'او از یک بار شلیک شب لئون مصون است.یک جلیقه دارد.تعیین شلیک شب از طرف گروه به عهده پدرخوانده است و اگر از بازی خارج شود دیگر اعضا به جای او شلیک می کنند.پدرخوانده دارای توانایی حس ششم است و اگر در شب تصمیم بگیرد به جای شلیک از حس ششم استفاده کند باید نقش بازیکنی را درست حدس بزند و توسط گرداننده تائید شود.بازیکنی که پدرخوانده نقش او را درست حدس زده است سلاخی می شود یعنی اگر سپر داشته باشد یا دکتر او را سیو کرده باشد بازهم از بازی خارج می شود و آن شب توانایی وی اعمال نخواهد شد و پس از خروج از بازی توسط کنستانتین قابل احضار نمی باشد.استعلام پدرخوانده برای نوستراداموس شهروندی بوده ولی برای همشهری کین مافیایی و مثبت خواهد بود.',
        matadorDesc:
          'شب ها با تیم مافیا بیدار می شود و هر شب از توانایی خود استفاده می کند.در شب هر بازیکنی را نشان دهد توانایی شب او را آن شب از وی خواهد گرفت و فرد نشان شده اگر بیدار شود با ضربدر گرداننده مواجه می شود اما فردا مجدد می تواند از توانایی اش استفاده کند.ماتادور دو شب متوالی نمی تواند یک بازیکن را نشان کند.',
        saulDesc:
          'اگر فردی از گروه مافیا خارج شود ساول می تواند جای شلیک شب معامله و خریداری انجام دهد.ساول گودمن فقط یکبار می تواند یکی از شهروندان ساده را به یک مافیای ساده تبدیل کند.با علامت او همان شب گرداننده آن فرد را از نقش جدیدش یعنی مافیای ساده مطلع می کند و وی را بیدار می کند تا هم تیمی های خود را بشناسد.اگر ساول گودمن شهروند غیرساده یا نوستراداموس را انتخاب کند با ضربدر گرداننده مواجه شده و گرداننده نشانش را بیدار نمی کند.توانمندی ساول و شلیک آن شب مافیا نیز از بین می رود.',
        ckaneDesc:
          'شهروندی است که در یکی از شب ها به انتخاب خود به دعوت گرداننده یکی از بازیکنان را نشان می دهد.اگر یک مافیا را درست نشان کرده باشد صبح روز بعد گرداننده ساید مافیای نشان شده را در جمع افشا می کند.و همشهری کین شب بعد کشته می شود.دکتر توانایی نجات او را ندارد.اما اگر نشانش از ساید مافیا نبود گرداننده هیچ چیزی اعلام نخواهد کرد و همشهری کین در بازی خواهد ماند و استعلامش از بین خواهد رفت.اگر او یا نشانش کشته شوند عملیات شب وی اجرا نشده و از بین نمی رود و همچنان باقی می ماند.استعلام پدرخوانده برای همشهری کین مافیایی است.',
        leonDesc:
          'هرشبی که بخواهد می تواند به یکی از اعضای تیم مافیا شلیک کند.اما با شلیک اشتباه به شهروندان به مجازات خودش کشته می شود و دکتر نمی تواند او را نجات دهد.لئون یک جلیقه دارد که یکبار از تیر نجات پیدا می کند.حداکثر دو شلیک دارد.',
        doctorDesc:
          'هرشب می تواند جان یک نفر چه عضو مافیا و چه عضو شهروندی را نجات دهد.جان خودش را یکبار می تواند در طول بازی نجات دهد ولی در نجات جان دیگران محدودیتی ندارد.',
        constantineDesc:
          'گرداننده کنستانتین را بیدار می کند تا او به انتخاب خود و تنها یک بار یک نفر از بازیکنان اخراجی اعم از مافیا شهروند و یا مستقل را به بازی برگرداند.غیر از نقش های افشا شده.توانایی های بازیکن احضار شده ادامه پیدا می کند و از بین نمی رود و از نو نمی شود.',
        citizenDesk:
          'نقش شهروند ساده کمک به هم تیمی های خود در تشخیص مافیا به درستی است و رای دادن با زرنگی به اعضای مافیاست. او در شب نقش خاصی را ایفا نمی کند و بیشتر به روند بازی و تیم شهروندی در پیروز شدن است.\n شهروند ساده میبایست سعی کند در روز مافیا ها را با دقت شناسایی کند و به آن ها رای دهد و در شب عمل خاصی را انجام نمی دهد.',
        nustraDesc:
          'در شب معارفه گرداننده او را بیدار می کند.نوستراداموس به انتخاب خود سه بازیکن را به گرداننده نشان می دهد.سپس گرداننده به او تعداد مافیا های موجود در میان این سه را اعلام می کند و پیش بینی او مبنی بر پیروزی یکی از دو ساید را از او می پرسد.نوستراداموس پیش بینی می کند شهروندان برنده خواهند شد یا مافیا ها.از این پس او برای برنده شدن سایدی که انتخاب کرده است تلاش می کند.بدون آنکه دیگر افراد بدانند وی به چه سایدی پیوسته است.اگر ساید مورد انتخابش برنده شد او نیز برنده است و اگر ساید مورد انتخابش بازنده شد او نیز بازنده خواهد شد.شلیک هیچ یک از دو ساید بر او موثر نخواهد بود و در شب کشته نخواهد شد.مگر با حس ششم پدرخوانده اما در روز با رای گیری از بازی خارج خواهد شد.استعلام پدرخوانده برای وی شهروندی خواهد بود.',
      },
      lastMoveCards: {
        lambsSilence: 'سکوت بره ها',
        lambDesc:
          'بازیکن اخراجی با نشان کردن دو نفر٬ آنان را بمدت یک روز سایلنت کرده و افرادی که نشان شده باشند٬ فردا حتی در دفاع امکان صحبت کردن ندارند. اگر تعداد بازیکنان به نصف رسید٬ در سکوت بره ها یک نفر سایلنت خواهد شد.',
        IdentityDisclosure: 'افشای هویت',
        identityDesc:
          'اگر بازیکن اخراجی این کارت را انتخاب کند٬ گرداننده بدون نیاز به استعالم جمعی نقش دقیق او را فاش میکند و او از بازی بیرون میرود. در این حالت امکان بازگشت به بازی توسط کنستانتین را ندارد.',
        beautifulMind: 'ذهن زیبا',
        beautifalJackDesc:
          'اگر صاحب این کارت بتواند فقط جک گنجشکه را از بین بازیکنان داخل بازی شناسایی کند. به بازی برمیگردد و جک گنجشکه بجای او از بازی خارج میشود.\n اگر جک گنجشکه این کارت را انتخاب کند٬ بدون نیاز به استعالم به بازی باز میگردد اما سپر وی از بین رفته و با شلیک شب کشته خواهد شد',
        beautifalNustraDesc:
          'اگر صاحب این کارت بتواند فقط نوستراداموس را از بین بازیکنان داخل بازی شناسایی کند. به بازی برمیگردد و نوستراداموس بجای او از بازی خارج میشود.\n اگر نوستراداموس این کارت را انتخاب کند٬ بدون نیاز به استعالم به بازی باز میگردد اما سپر وی از بین رفته و با شلیک شب کشته خواهد شد',
        bracelet: 'دستبند',
        braceletDesc:
          'بازیکن اخراجی با کارت دستبند هرکس را نشان کند٬ توانمندی های ان شب را از وی میگیرد.\n نکته: اگر تنها یک مافیا در بازی مانده باشد و کارت دسبتند دریافت کرده باشد٬ همچنان امکان شلیک خواهد داشت. )شات مختص به یک مافیا نیست٬ یک توانایی تیمی است(',
        faceoff: 'تغییر چهره',
        faceoffDesc:
          'بازیکن قبل از خروج کارت نقش خود را با یکی از بازیکنان عوض می کند.',
      },
      godfather: 'پدرخوانده',
      matador: 'ماتادور',
      saul: 'ساول گودمن',
      ckane: 'همشهری کین',
      leon: 'لئون حرفه ای',
      doctor: 'دکتر واتسون',
      constantine: 'کنستانتین',
      citizen: 'شهروند ساده',
      nustradamus: 'نوستراداموس',
      jack: 'جک گنجیشکه',
    },
    roles: 'نقش ها',
    lastMoveCards: 'کارت های حرکت آخر',
    senario: 'سناریو بازی',
    myPlayers: 'بازیکن های من',
    playerName: 'نام بازیکن',
    oldPlayer: 'بازیکن قدیمی',
    newPlayer: 'بازیکن جدید',
    lastMove: 'حرکت آخر',
    day: 'روز',
    night: 'شب',
    mafia: 'مافیا',
    citizen: 'شهروند',
    showRoles: 'نمایش نقش ها',
    deleted: 'حذف شده ها',
    noBodyRemovedFromGame: 'هیچ بازیکنی از بازی خارج نشده',
    doYouWantToCloseGame: 'از بازی خارج می شوید ؟',
    doYouWantToCloseApp: 'از برنامه خارج می شوید ؟',
    closeIt: 'خارج شو!',
    startGame: 'شروع بازی',
    chooseRoleForPlayers: 'تعیین نقش برای بازیکن ها',
    addPlayerToThisGame: 'اضافه کردن بازیکن به این بازی',
    playersChoosen: 'بازیکنان حاضر در بازی',
    anyPlayerExist: 'هیج بازیکنی نداری!',
    gameTitle: 'بازی',
    role: 'نقش',
    player: 'بازیکن',
    players: 'بازیکن ها',
    godfather: 'پدرخوانده',
    jackLastCards: 'کارت های جک گنجشکه',
    nustraLastCards: 'کارت های نوستراداموس',
    jackLast: 'کارت های جک',
    nustraLast: 'کارت های نوستراداموس',
    jackSenario: 'سناریو  جک گنجیشکه',
    nustraSenario: 'سناریو  نوستراداموس',
    description: 'توضیحات بازی',
    jackDescription:
      'بازی پدرخوانده جک گنجشکه، یک بازی دورهمی نقش مخفی بر پایه استدلال و استنتاج است در بازی  بازیکن ها به سه دسته اکثریت شهروند٬ تیم مافیا و تک نقش مستقل تقسیم میشوند. نقش هایی که از ابتدا جز صاحب نقش و گرداننده کسی از آن مطلع نیست. هدف شهروندان در دست گرفتن شهر و پاکسازی از مافیا هاست و پیروزی مافیاها در گرو برابری با تعداد شهروندان است البته به جز جک.\n بازی در دو بخش شب ها و روز های متوالی انجام میشود. در روز معارفه٬ همه نقش خود را میدانند اما اعضای مافیا همتیمی های خود را نمیشناسند. بازیکنان 30 ثانیه فرصت دارند تا گفتگو کنند و خود را معرفی کنند روز معارفه چالش ندارد .سپس در شب معارفه گرداننده تیم مافیا را بیدار میکند تا همدیگر را بشناسند.\n از آغاز هر روز گرداننده به اختیار خود به بازیکنان نوبت میدهد تا حداکثر 40 ثانیه به گفتگو بپردازند. روز ها همه نقش شهروند را بازی میکنند و در فرایند اتهام زنی٬ به چالش کشیدن، دفاع و رای گیری تالش میکنند اعضای مافیا را کشف و با اکثریت ارا از شهر خارج کنند. در زمان گفتگو بازیکنان دیگر در سکوت کامل میتوانند با عالمت دست تائید یا عدم تائید خود را نشان دهند.\n در گفتگو هرکس میتواند دیگران را به مافیا بودن متهم کند یا به شهروند بودن اتهام را از آنان صلب کند اما هیچ کس حق ندارد به نقش و توانایی های شب خود به طور مستقیم یا غیرمستقیم اشاره کند و یا درباره نقش خود بلوف بزند – اطلاق به نقش ها و اتفاقات شب ممنوع است \nهر روز پس از گفتگو با رای گیری مرحله اول٬ بازیکنانی که بیشترین رای اتهام نصف منهای یک دریافت کرده اند به دفاع میروند و از خود در برابر اتهامات دفاع میکنند. با رای گیری مرحله دوم که در روز و در برابر انظار همه بازیکنان اجرا میگردد (با اکثریت نسبی٬ فردی که بیشترین رای را آورده از شهر اخراج میشود) اگر تنها یک نفر به دفاع برسد، با حد نصاب ذکر شده در بالا خارج خواهد شد. اگر دو نفر و بیشتر به دفاع بیایند ٬هرکس تعداد بیشتری رای بیاورد از بازی خارج میشود)اگر همه صفر رای بیاورند در بازی خواهند نشست(و تعداد رای دادن به افراد حتی در دور دوم آزاد است حتی افرادی که در دفاع هستند میتوانند رای بدهند. اگر تعداد رای دور دوم دو نفر یکسان باشد٬ قرعه مرگ بازیکن اخراجی را تعیین میکند.زمان دفاع 40 ثانیه می باشد.',
    gameRules: 'قوانین بازی',
    nustraDescription:
      'بازی پدرخوانده، یک بازی دورهمی نقش مخفی بر پایه استدلال و استنتاج است. در بازی پدرخوانده؛ بازیکن ها به سه دسته اکثریت شهروند٬ تیم مافیا و تک نقش مستقل تقسیم میشوند.\n نقش هایی که از ابتدا جز صاحب نقش و گرداننده کسی از آن مطلع نیست. هدف شهروندان در دست گرفتن شهر و پاکسازی از مافیا هاست و پیروزی مافیاها در گرو برابری با تعداد شهروندان است. نقش مستقل خود انتخاب میکند با کدام تیم بازی کرده و سعی در پیروزی ساید مورد نظر دارد. \nبازی در دو بخش شب ها و روز های متوالی انجام میشود. در روز معارفه٬ همه نقش خود را میدانند اما اعضای مافیا همتیمی های خود را نمیشناسند. بازیکنان 30 ثانیه فرصت دارند تا گفتگو کنند و خود را معرفی کنند )روز معارفه چالش ندارد .(سپس در شب معارفه گرداننده تیم مافیا را بیدار میکند تا همدیگر را بشناسند.\n از آغاز هر روز گرداننده به اختیار خود به بازیکنان نوبت میدهد تا حداکثر 40 ثانیه به گفتگو بپردازند. روز ها همه نقش شهروند را بازی میکنند و در فرایند اتهام زنی٬ به چالش کشیدن، دفاع و رای گیری تالش میکنند اعضای مافیا را کشف و با اکثریت ارا از شهر خارج کنند. در زمان گفتگو بازیکنان دیگر در سکوت کامل میتوانند با عالمت دست تائید یا عدم تائید خود را نشان دهند.\n در گفتگو هرکس میتواند دیگران را به مافیا بودن متهم کند یا به شهروند بودن اتهام را از آنان صلب کند اما هیچ کس حق ندارد به نقش و توانایی های شب خود به طور مستقیم یا غیرمستقیم اشاره کند و یا درباره نقش خود بلوف بزند – اطالق به نقش ها و اتفاقات شب ممنوع است \nهر روز پس از گفتگو با رای گیری مرحله اول٬ بازیکنانی که بیشترین رای اتهام نصف منهای یک دریافت کرده اند به دفاع میروند و از خود در برابر اتهامات دفاع میکنند. با رای گیری مرحله دوم که در روز و در برابر انظار همه بازیکنان اجرا میگردد (با اکثریت نسبی٬ فردی که بیشترین رای را آورده از شهر اخراج میشود) اگر تنها یک نفر به دفاع برسد، با حد نصاب ذکر شده در بالا خارج خواهد شد. اگر دو نفر و بیشتر به دفاع بیایند ٬هرکس تعداد بیشتری رای بیاورد از بازی خارج میشود)اگر همه صفر رای بیاورند در بازی خواهند نشست(و تعداد رای دادن به افراد حتی در دور دوم آزاد است حتی افرادی که در دفاع هستند میتوانند رای بدهند. اگر تعداد رای دور دوم دو نفر یکسان باشد٬ قرعه مرگ بازیکن اخراجی را تعیین میکند.زمان دفاع 40 ثانیه می باشد.\n در پایان رای گیری هر روز بازیکن اخراجی از بین شش کارت حرکت اخر یک کارت را به طور تصادفی انتخاب میکند. تنها با برداشتن اتفاقی کارت ذهن زیبا و حدس درست نقش نوستراداموس او بدون اعالم نقشش از سوی گرداننده به جای نوستراداموس به بازی بر میگردد. بازیکنی که رای خروج اورده است٬ امکان صحبت )وصیت ( ندارد و تنها باید به کارت حرکت اخر خود اکتفا کند. کارت های حرکت اخر باید اجرا شوند. ) اکت اجباریست ( در ابتدای هر روز گرداننده برای استعالم نقش های خارج از بازی رای گیری میکند. این رای گیری برای استعالم فقط 2 بار در کل بازی ممکن است. با نظر اکثریت بازیکنان گرداننده فقط ساید بازیکنان اخراجی را فاش میکند. استعالم نوستراداموس؛ مستقل خواهد بود\n در بازی 2 استعالم وضعیت وجود دارد که با اعالم ساید انجام میگیرد.نوستراداموس با ساید مستقل اعالم میشود.',
    nustraRules: {
      first:
        'مافیا در شب٬ باید از میان قابلیت های ساول و پدرخوانده یکی را انتخاب کند؛ یعنی؛ ۱ -یا تیر شلیک میشود ؛ ۲ -یا پدرخوانده از حس ششم خود استفاده میکند ؛ ۳ -یا ساول یکی از شهروندان ساده را میخرد ؛ و نمیتوان همه قابلیت ها را در یک شب استفاده کرد. دیگر بازیکنان نمیدانند که تیم مافیایی در شب از چه قابلیتی استفاده کردند. تنها درصورتی که پدرخوانده از حس ششم به درستی استفاده کرده باشد٬ بازیکنان صبح با اعالم فرد افشا شده توسط گرداننده متوجه میشوند که پدرخوانده از حس ششم استفاده کرده است.',
      second:
        'در شبی که قرار است ساول گود من خریداری کند،گرداننده اعالم میکند که قرار است خریداری توسط تیم مافیا انجام گیرد.',
      third:
        ' اگر نوستراداموس از بین 3 انتخاب استعلام 2 مافیا را بگیرد باید در ساید مافیا بازی کند.',
      fourth:
        ' اگر نوستراداموس کارت ذهن زیبا بکشد خودش را حدس می زند و به بازی بر می گردد ولی دیگر زره شب ندارد.',
    },
    jackRules: {
      first:
        'مافیا در شب٬ باید از میان قابلیت های ساول و پدرخوانده یکی را انتخاب کند؛ یعنی؛ ۱ -یا تیر شلیک میشود ؛ ۲ -یا پدرخوانده از حس ششم خود استفاده میکند ؛ ۳ -یا ساول یکی از شهروندان ساده را میخرد ؛ و نمیتوان همه قابلیت ها را در یک شب استفاده کرد. دیگر بازیکنان نمیدانند که تیم مافیایی در شب از چه قابلیتی استفاده کردند. تنها درصورتی که پدرخوانده از حس ششم به درستی استفاده کرده باشد٬ بازیکنان صبح با اعالم فرد افشا شده توسط گرداننده متوجه میشوند که پدرخوانده از حس ششم استفاده کرده است.',
      second:
        'در شبی که قرار است ساول گود من خریداری کند،گرداننده اعالم میکند که قرار است خریداری توسط تیم مافیا انجام گیرد.',
      third: ' اگر جک و دو شهروند و سه مافیا در بازی باشد بازی تمام نشده است.',
      fourth:
        ' اگر جک کارتش شو شده باشد در ذهن زیبا باید فرد طلسم شده را حدس بزند.',
      fifth: 'اگر همشهری کین شات شب شود استعلامش اعلام نمی شود.',
      sixth: ' اگر جک بیرون باشد کارت ذهن زیبا حذف می شود.',
      seventh:
        'اگر کسی سلاخی پدرخوانده شود قابلیت استفاده توانایی در همان شب را هم ندارد.',
    },
    jackRoles: 'نقش های جک گنجیشکه',
    nustraRoles: 'نقش های نوستراداموس',
    chooseRoleProblem: 'فقط از یک نوع بازی میتونی کارت انتخاب کنی',
    cardChoosingDescription:
      'شما فقط میتونید از یک سبک بازی کارت انتخاب کنید درصورت تایید این اخطارانتخاب های شما حذف میشوند و به سبک دیگه ی بازی منتقل میشوید',
    areYouAgree: 'موافقی؟',
    addRoletoThisGame: 'اضافه کردن نقش به بازی',
    free: 'مستقل',
    roleAssignment: 'تعیین نقش',
    allPlayersSeenTheirRoles: 'تمام بازیکنان کارت های خود را دیدن',
    goToTheGame: 'برو به بازی',
    insideGame: 'داخل بازی',
    sitoutGame: 'حذف شده ها',
    silent: 'سکوت',
    speak: 'حرف بزن',
    disability: 'بی خاصیت',
    playerRemovedFromGame:
      ' {player} از بازی حذف شد و می تواند توسط کنستانتین به بازی برگردانده شود',
    addPlayerAndRoleAndGiveRole:
      'بازیکن ها و نقش ها رو انتخاب کن و به بازیکن ها نقش بده تا بتونی بازی روشروع کنی',
  },
};

export default fa;
